music_app/app/controllers/albums_controller.rb

  def new
    @bands = Band.all
---
SELECT "bands".* FROM "bands"

  def create
    @album = Album.new(album_params)
    if @album.save!
---
INSERT INTO "albums" ("title", "year", "band_id", "live", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "asga"], ["year", 21324], ["band_id", 1], ["live", false], ["created_at", "2022-03-15 21:25:52.403622"], ["updated_at", "2022-03-15 21:25:52.403622"]]

  def edit
    @bands = Band.all
    @album = Album.find(params[:id])
---
SELECT "bands".* FROM "bands"
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

  def update
    @album = Album.find(params[:id])
    if @album.update(album_params)
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "albums" SET "band_id" = $1, "updated_at" = $2 WHERE "albums"."id" = $3  [["band_id", 2], ["updated_at", "2022-03-15 21:36:06.623677"], ["id", 5]]