music_app/app/controllers/bands_controller.rb

  def update
    @band = Band.find(params[:id])
    if @band.update(band_params)
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "bands" SET "name" = $1, "updated_at" = $2 WHERE "bands"."id" = $3  [["name", "rock"], ["updated_at", "2022-03-15 18:50:20.869956"], ["id", 1]]