music_app/app/controllers/sessions_controller.rb

  def create
    @user = User.find_by(email: params[:user][:email],password: params[:user][:password])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "testing"], ["LIMIT", 1]]